-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- 생성 시간: 25-07-11 06:07
-- 서버 버전: 10.4.32-MariaDB
-- PHP 버전: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `hanatour`
--

-- --------------------------------------------------------

--
-- 테이블 구조 `event_board1`
--

CREATE TABLE `event_board1` (
  `idx` int(11) NOT NULL,
  `title` varchar(200) NOT NULL,
  `img_url` varchar(500) NOT NULL,
  `period_start` date NOT NULL,
  `period_end` date NOT NULL,
  `content` text NOT NULL,
  `created_time` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 테이블의 덤프 데이터 `event_board1`
--

INSERT INTO `event_board1` (`idx`, `title`, `img_url`, `period_start`, `period_end`, `content`, `created_time`) VALUES
(1, '[혜택] 하나투어 APP 설치!', 'uploads/img_686f2fdb0a2f56.73708030.png', '2025-07-01', '2026-12-10', 'QR 코드 스캔해서 하나투어 APP 다운받고, 보다 간편하게 최저가 예약하세요', '2025-07-10 12:13:31'),
(2, '[이벤트] 하나트래플 - 게릴라 핫딜', 'uploads/img_686f399c97e049.75086561.png', '2025-07-01', '2025-07-13', '빅하투페어 특집! 단 3일동안 게릴라 핫딜\r\n이번 여름 0원으로 호캉스 갈래?', '2025-07-10 12:55:08'),
(3, '[이벤트] 하나LIVE 라이브 전용 혜택', 'uploads/img_686f39f0afc483.94292832.png', '2025-07-02', '2025-07-31', '하나 LIVE에서 라이브 전용 상품 혜택을 놓치지 마세요!', '2025-07-10 12:56:32'),
(4, '[타임세일] 매주 월요일 오전 10시 한정 특가', 'uploads/img_686f3a26c44306.01469617.png', '2025-07-01', '2025-07-31', '빅하투페어 특집 타임세일 진행!', '2025-07-10 12:57:26'),
(5, '[이벤트] 동영상 리뷰 작성 100% 마일리지 지급', 'uploads/img_686f3a71552ee6.77779473.png', '2025-06-01', '2025-07-05', '동영상 리뷰 작성하고, 최대 6,000마일리지 받자!', '2025-07-10 12:58:41'),
(6, '[안내] 하나투어 마일리지 안내', 'uploads/img_686f3aa3628ae8.99390592.png', '2025-01-10', '2025-12-31', '여행도 가고, 적립도 받는 하나투어 마일리지 사용 안내', '2025-07-10 12:59:31'),
(7, '[공동구매] 해외호텔 공동 구매 핫딜', 'uploads/img_686f3ae476a085.93543277.png', '2025-07-01', '2025-08-30', '빅하투페어 특집, 해외 호텔 공동 구매 핫딜 이벤트', '2025-07-10 13:00:36'),
(8, '[할인] 여행을 원한다면?? 하나팩 2.0 출시', 'uploads/img_686f3b4e587f76.43957903.png', '2025-06-01', '2025-06-30', '여행 구독 서비스 - 하나팩 2.0을 알아보세요!', '2025-07-10 13:02:22'),
(9, '[특가] 일본여행 골든타임 특가', 'uploads/img_686f3e84283f82.98312578.jpg', '2025-06-30', '2025-07-09', '일본여행 골든타임 특가, 황금시즌 특가 상품을 만나보세요!', '2025-07-10 13:16:04'),
(10, '[특가] 미국 여행 고민 중이신가요?', 'uploads/img_686f3efa30cef1.05189191.jpg', '2025-08-01', '2025-09-30', '항공권부터 숙박까지 엄선한 가이드 여행을 떠나보세요', '2025-07-10 13:18:02'),
(11, '[혜택] 취소 수수료 NO! 출발 확정 여행', 'uploads/img_686f3f62c65ef8.43636069.jpg', '2025-07-01', '2025-09-30', '지금 예약하면 100% 출발확정 ! 취소 수수료 NO!', '2025-07-10 13:19:46'),
(12, '[이벤트] 방학&연휴 세부vs보홀 떠나보자', 'uploads/img_686f4e59d7c8d5.71150907.jpg', '2025-07-01', '2025-08-31', '세부/보홀 30만원대 ~ 좌석확보! #세부제이파크 #보홀헤난타왈라', '2025-07-10 14:23:37'),
(13, '[핫딜] 72시간 호텔 메가 핫딜', 'uploads/img_686f5080c6eb34.86450840.jpg', '2025-07-11', '2025-07-14', '역대급 할인 쿠폰과 200% 최저가 보상제', '2025-07-10 14:32:48'),
(14, '[이벤트] 매주 업데이트 자유여행 득템 마켓', 'uploads/img_686f50b3b456b1.70980006.jpg', '2025-07-10', '2025-12-31', '매주 업데이트 되는 자유여행 상품을 득템해보세요~!', '2025-07-10 14:33:39'),
(15, '[이벤트] 7월! 최대 77% 럭키세븐 업!', 'uploads/img_686f50f1064cd1.32071755.jpg', '2025-07-01', '2025-07-31', '7월 한달동안 진행되는 선착순 ~77% 할인 행사', '2025-07-10 14:34:41'),
(16, '[핫딜] MEGA 해외 항공 특가전 ', 'uploads/img_686f5138769501.41522052.jpg', '2025-07-07', '2025-07-14', '핫딜 인기 도시 회원 전용 특가!\r\n1만원 항공 쿠폰 + 호텔/현지투어/입장권 추가 할인쿠폰 제공', '2025-07-10 14:35:52'),
(17, '[특가] 싱가포르 - 5월의 특가 상품', 'uploads/img_686f5182ebc3e3.43140618.jpg', '2025-05-01', '2025-05-31', '도심 속 자연, 미식, 액티비티까지! 모두 담은 완벽한 여행', '2025-07-10 14:37:06'),
(18, '[특가] 유럽여행 완전 정복', 'uploads/img_686f51cbe3cd77.37115038.jpg', '2025-07-10', '2025-09-30', '최대 17만원 즉시할인쿠폰 증정, 할인+혜택 받고 예약하자', '2025-07-10 14:38:19'),
(20, '[혜택] 하나투어 APP 설치!', 'uploads/img_686f2fdb0a2f56.73708030.png', '2025-07-01', '2026-12-10', 'QR 코드 스캔해서 하나투어 APP 다운받고, 보다 간편하게 최저가 예약하세요', '2025-07-10 12:13:31'),
(21, '[이벤트] 하나트래플 - 게릴라 핫딜', 'uploads/img_686f399c97e049.75086561.png', '2025-07-01', '2025-07-13', '빅하투페어 특집! 단 3일동안 게릴라 핫딜\r\n이번 여름 0원으로 호캉스 갈래?', '2025-07-10 12:55:08'),
(22, '[이벤트] 하나LIVE 라이브 전용 혜택', 'uploads/img_686f39f0afc483.94292832.png', '2025-07-02', '2025-07-31', '하나 LIVE에서 라이브 전용 상품 혜택을 놓치지 마세요!', '2025-07-10 12:56:32'),
(23, '[타임세일] 매주 월요일 오전 10시 한정 특가', 'uploads/img_686f3a26c44306.01469617.png', '2025-07-01', '2025-07-31', '빅하투페어 특집 타임세일 진행!', '2025-07-10 12:57:26'),
(24, '[이벤트] 동영상 리뷰 작성 100% 마일리지 지급', 'uploads/img_686f3a71552ee6.77779473.png', '2025-06-01', '2025-07-05', '동영상 리뷰 작성하고, 최대 6,000마일리지 받자!', '2025-07-10 12:58:41'),
(25, '[안내] 하나투어 마일리지 안내', 'uploads/img_686f3aa3628ae8.99390592.png', '2025-01-10', '2025-12-31', '여행도 가고, 적립도 받는 하나투어 마일리지 사용 안내', '2025-07-10 12:59:31'),
(26, '[공동구매] 해외호텔 공동 구매 핫딜', 'uploads/img_686f3ae476a085.93543277.png', '2025-07-01', '2025-08-30', '빅하투페어 특집, 해외 호텔 공동 구매 핫딜 이벤트', '2025-07-10 13:00:36'),
(27, '[할인] 여행을 원한다면?? 하나팩 2.0 출시', 'uploads/img_686f3b4e587f76.43957903.png', '2025-06-01', '2025-06-30', '여행 구독 서비스 - 하나팩 2.0을 알아보세요!', '2025-07-10 13:02:22'),
(28, '[특가] 일본여행 골든타임 특가', 'uploads/img_686f3e84283f82.98312578.jpg', '2025-06-30', '2025-07-09', '일본여행 골든타임 특가, 황금시즌 특가 상품을 만나보세요!', '2025-07-10 13:16:04'),
(29, '[특가] 미국 여행 고민 중이신가요?', 'uploads/img_686f3efa30cef1.05189191.jpg', '2025-08-01', '2025-09-30', '항공권부터 숙박까지 엄선한 가이드 여행을 떠나보세요', '2025-07-10 13:18:02'),
(30, '[혜택] 취소 수수료 NO! 출발 확정 여행', 'uploads/img_686f3f62c65ef8.43636069.jpg', '2025-07-01', '2025-09-30', '지금 예약하면 100% 출발확정 ! 취소 수수료 NO!', '2025-07-10 13:19:46'),
(31, '[이벤트] 방학&연휴 세부vs보홀 떠나보자', 'uploads/img_686f4e59d7c8d5.71150907.jpg', '2025-07-01', '2025-08-31', '세부/보홀 30만원대 ~ 좌석확보! #세부제이파크 #보홀헤난타왈라', '2025-07-10 14:23:37'),
(32, '[핫딜] 72시간 호텔 메가 핫딜', 'uploads/img_686f5080c6eb34.86450840.jpg', '2025-07-11', '2025-07-14', '역대급 할인 쿠폰과 200% 최저가 보상제', '2025-07-10 14:32:48'),
(33, '[이벤트] 매주 업데이트 자유여행 득템 마켓', 'uploads/img_686f50b3b456b1.70980006.jpg', '2025-07-10', '2025-12-31', '매주 업데이트 되는 자유여행 상품을 득템해보세요~!', '2025-07-10 14:33:39'),
(34, '[이벤트] 7월! 최대 77% 럭키세븐 업!', 'uploads/img_686f50f1064cd1.32071755.jpg', '2025-07-01', '2025-07-31', '7월 한달동안 진행되는 선착순 ~77% 할인 행사', '2025-07-10 14:34:41'),
(35, '[핫딜] MEGA 해외 항공 특가전 ', 'uploads/img_686f5138769501.41522052.jpg', '2025-07-07', '2025-07-14', '핫딜 인기 도시 회원 전용 특가!\r\n1만원 항공 쿠폰 + 호텔/현지투어/입장권 추가 할인쿠폰 제공', '2025-07-10 14:35:52'),
(36, '[특가] 싱가포르 - 5월의 특가 상품', 'uploads/img_686f5182ebc3e3.43140618.jpg', '2025-05-01', '2025-05-31', '도심 속 자연, 미식, 액티비티까지! 모두 담은 완벽한 여행', '2025-07-10 14:37:06'),
(37, '[특가] 유럽여행 완전 정복', 'uploads/img_686f51cbe3cd77.37115038.jpg', '2025-07-10', '2025-09-30', '최대 17만원 즉시할인쿠폰 증정, 할인+혜택 받고 예약하자', '2025-07-10 14:38:19'),
(38, '[혜택] 하나투어 APP 설치!', 'uploads/img_686f2fdb0a2f56.73708030.png', '2025-07-01', '2026-12-10', 'QR 코드 스캔해서 하나투어 APP 다운받고, 보다 간편하게 최저가 예약하세요', '2025-07-10 12:13:31'),
(39, '[이벤트] 하나트래플 - 게릴라 핫딜', 'uploads/img_686f399c97e049.75086561.png', '2025-07-01', '2025-07-13', '빅하투페어 특집! 단 3일동안 게릴라 핫딜\r\n이번 여름 0원으로 호캉스 갈래?', '2025-07-10 12:55:08'),
(40, '[이벤트] 하나LIVE 라이브 전용 혜택', 'uploads/img_686f39f0afc483.94292832.png', '2025-07-02', '2025-07-31', '하나 LIVE에서 라이브 전용 상품 혜택을 놓치지 마세요!', '2025-07-10 12:56:32'),
(41, '[타임세일] 매주 월요일 오전 10시 한정 특가', 'uploads/img_686f3a26c44306.01469617.png', '2025-07-01', '2025-07-31', '빅하투페어 특집 타임세일 진행!', '2025-07-10 12:57:26'),
(42, '[이벤트] 동영상 리뷰 작성 100% 마일리지 지급', 'uploads/img_686f3a71552ee6.77779473.png', '2025-06-01', '2025-07-05', '동영상 리뷰 작성하고, 최대 6,000마일리지 받자!', '2025-07-10 12:58:41'),
(43, '[안내] 하나투어 마일리지 안내', 'uploads/img_686f3aa3628ae8.99390592.png', '2025-01-10', '2025-12-31', '여행도 가고, 적립도 받는 하나투어 마일리지 사용 안내', '2025-07-10 12:59:31'),
(44, '[공동구매] 해외호텔 공동 구매 핫딜', 'uploads/img_686f3ae476a085.93543277.png', '2025-07-01', '2025-08-30', '빅하투페어 특집, 해외 호텔 공동 구매 핫딜 이벤트', '2025-07-10 13:00:36'),
(45, '[할인] 여행을 원한다면?? 하나팩 2.0 출시', 'uploads/img_686f3b4e587f76.43957903.png', '2025-06-01', '2025-06-30', '여행 구독 서비스 - 하나팩 2.0을 알아보세요!', '2025-07-10 13:02:22'),
(46, '[특가] 일본여행 골든타임 특가', 'uploads/img_686f3e84283f82.98312578.jpg', '2025-06-30', '2025-07-09', '일본여행 골든타임 특가, 황금시즌 특가 상품을 만나보세요!', '2025-07-10 13:16:04'),
(47, '[특가] 미국 여행 고민 중이신가요?', 'uploads/img_686f3efa30cef1.05189191.jpg', '2025-08-01', '2025-09-30', '항공권부터 숙박까지 엄선한 가이드 여행을 떠나보세요', '2025-07-10 13:18:02'),
(48, '[혜택] 취소 수수료 NO! 출발 확정 여행', 'uploads/img_686f3f62c65ef8.43636069.jpg', '2025-07-01', '2025-09-30', '지금 예약하면 100% 출발확정 ! 취소 수수료 NO!', '2025-07-10 13:19:46'),
(49, '[이벤트] 방학&연휴 세부vs보홀 떠나보자', 'uploads/img_686f4e59d7c8d5.71150907.jpg', '2025-07-01', '2025-08-31', '세부/보홀 30만원대 ~ 좌석확보! #세부제이파크 #보홀헤난타왈라', '2025-07-10 14:23:37'),
(50, '[핫딜] 72시간 호텔 메가 핫딜', 'uploads/img_686f5080c6eb34.86450840.jpg', '2025-07-11', '2025-07-14', '역대급 할인 쿠폰과 200% 최저가 보상제', '2025-07-10 14:32:48'),
(51, '[이벤트] 매주 업데이트 자유여행 득템 마켓', 'uploads/img_686f50b3b456b1.70980006.jpg', '2025-07-10', '2025-12-31', '매주 업데이트 되는 자유여행 상품을 득템해보세요~!', '2025-07-10 14:33:39'),
(52, '[이벤트] 7월! 최대 77% 럭키세븐 업!', 'uploads/img_686f50f1064cd1.32071755.jpg', '2025-07-01', '2025-07-31', '7월 한달동안 진행되는 선착순 ~77% 할인 행사', '2025-07-10 14:34:41'),
(53, '[핫딜] MEGA 해외 항공 특가전 ', 'uploads/img_686f5138769501.41522052.jpg', '2025-07-07', '2025-07-14', '핫딜 인기 도시 회원 전용 특가!\r\n1만원 항공 쿠폰 + 호텔/현지투어/입장권 추가 할인쿠폰 제공', '2025-07-10 14:35:52'),
(54, '[특가] 싱가포르 - 5월의 특가 상품', 'uploads/img_686f5182ebc3e3.43140618.jpg', '2025-05-01', '2025-05-31', '도심 속 자연, 미식, 액티비티까지! 모두 담은 완벽한 여행', '2025-07-10 14:37:06'),
(55, '[특가] 유럽여행 완전 정복', 'uploads/img_686f51cbe3cd77.37115038.jpg', '2025-07-10', '2025-09-30', '최대 17만원 즉시할인쿠폰 증정, 할인+혜택 받고 예약하자', '2025-07-10 14:38:19'),
(56, '[혜택] 하나투어 APP 설치!', 'uploads/img_686f2fdb0a2f56.73708030.png', '2025-07-01', '2026-12-10', 'QR 코드 스캔해서 하나투어 APP 다운받고, 보다 간편하게 최저가 예약하세요', '2025-07-10 12:13:31'),
(57, '[이벤트] 하나트래플 - 게릴라 핫딜', 'uploads/img_686f399c97e049.75086561.png', '2025-07-01', '2025-07-13', '빅하투페어 특집! 단 3일동안 게릴라 핫딜\r\n이번 여름 0원으로 호캉스 갈래?', '2025-07-10 12:55:08'),
(58, '[이벤트] 하나LIVE 라이브 전용 혜택', 'uploads/img_686f39f0afc483.94292832.png', '2025-07-02', '2025-07-31', '하나 LIVE에서 라이브 전용 상품 혜택을 놓치지 마세요!', '2025-07-10 12:56:32'),
(59, '[타임세일] 매주 월요일 오전 10시 한정 특가', 'uploads/img_686f3a26c44306.01469617.png', '2025-07-01', '2025-07-31', '빅하투페어 특집 타임세일 진행!', '2025-07-10 12:57:26'),
(60, '[이벤트] 동영상 리뷰 작성 100% 마일리지 지급', 'uploads/img_686f3a71552ee6.77779473.png', '2025-06-01', '2025-07-05', '동영상 리뷰 작성하고, 최대 6,000마일리지 받자!', '2025-07-10 12:58:41'),
(61, '[안내] 하나투어 마일리지 안내', 'uploads/img_686f3aa3628ae8.99390592.png', '2025-01-10', '2025-12-31', '여행도 가고, 적립도 받는 하나투어 마일리지 사용 안내', '2025-07-10 12:59:31'),
(62, '[공동구매] 해외호텔 공동 구매 핫딜', 'uploads/img_686f3ae476a085.93543277.png', '2025-07-01', '2025-08-30', '빅하투페어 특집, 해외 호텔 공동 구매 핫딜 이벤트', '2025-07-10 13:00:36');

-- --------------------------------------------------------

--
-- 테이블 구조 `members`
--

CREATE TABLE `members` (
  `idx` int(11) NOT NULL,
  `userid` varchar(245) NOT NULL,
  `username` varchar(145) NOT NULL,
  `passwd` varchar(200) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `regdate` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 테이블의 덤프 데이터 `members`
--

INSERT INTO `members` (`idx`, `userid`, `username`, `passwd`, `phone`, `regdate`) VALUES
(1, 'zzoa@naver.com', '조아랑', '$2y$10$JkzUl8V5vM.s9DiAptCwzuxtOlJiTOOh2E3bV.EaeEfejLYQaIv2O', '01011111111', '2025-07-10 10:24:57'),
(2, 'handsome@gmail.com', '차은우', '$2y$10$bNuqrh0UILlYWtlLeDwxP.bV.u7/vcTlQEZNd22Q/YTPpUXYX1MbG', '01012341234', '2025-07-10 10:27:26'),
(3, 'djssam@naver.com', '동주쌤', '$2y$10$5gVzPCI2we2W5M.c7VbQk.6VAPUSE4yi.wKuSlmrIhFQpVXSg1OV.', '01000001234', '2025-07-10 10:28:59'),
(4, 'jws@gmail.com', '장원석', '$2y$10$OBUhtcLo80flKmsuMBsM/.RGNzcK8q8nXFmRerdX/Foz8UodpPFHi', '01012340000', '2025-07-10 10:32:54'),
(7, 'test@naver.com', '테스트', '$2y$10$QjiuXVeiXkWwQnNnjV.8P.wy3hhH4YGIgeGgjsRH9uWDBUEJbCGZi', '01011112222', '2025-07-10 11:32:11'),
(8, 'jjw@gmail.com', '정진욱', '$2y$10$8VYCZxj5OQo.YPRCA7RAt.8v8RyaDz5syOzfkQ6x4jxmdHSfd5D.q', '01001231234', '2025-07-10 12:00:42');

--
-- 덤프된 테이블의 인덱스
--

--
-- 테이블의 인덱스 `event_board1`
--
ALTER TABLE `event_board1`
  ADD PRIMARY KEY (`idx`);

--
-- 테이블의 인덱스 `members`
--
ALTER TABLE `members`
  ADD PRIMARY KEY (`idx`);

--
-- 덤프된 테이블의 AUTO_INCREMENT
--

--
-- 테이블의 AUTO_INCREMENT `event_board1`
--
ALTER TABLE `event_board1`
  MODIFY `idx` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=63;

--
-- 테이블의 AUTO_INCREMENT `members`
--
ALTER TABLE `members`
  MODIFY `idx` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
